import React from 'react';
import HeaderWrapper from '../headerWrapper';
import Image from 'next/image';
import styles from './agency.module.scss';
import CTAButton from '../CTAButton';

const Agency = () => {
  return (
    <section className={styles.agencySection}>
      <div className={styles.headerBlock}>
        <HeaderWrapper
                                   href=""
                                   withBr={false}
                                   kicker="#Нейро-комьюнити"
                                   title="Больше,  "
                                   titleAccent="  чем агентство  "
                                 />
      </div>
      <div className={styles.grid}>
        <div className={styles.card + ' ' + styles.cardLeftTop}>
            <div className="flex items-center gap-2">
<div className={styles.iconWrap}>
            <Image src="/assets/icon_top1.png" alt="thumb" width={32} height={32} />
          </div>
          <h3>ПРИНЦИПИАЛЬНАЯ ПОЗИЦИЯ: <br /> <span> 100% БЕСПЛАТНО</span></h3>
            </div>
          
          <p>
            Мы идем против рынка инфобизнеса: у нас нет платных групп, «приваток» или скрытых тарифов. <br />
            <b>Вся информация доступна каждому.</b><br /><br />
            <b>Наша главная цель</b> — построить мощное комьюнити, нацеленное на взаимоподдержку и совместное развитие, а не на монетизацию доступа к знаниям.
          </p>
        </div>
        <div className={styles.logoPlaceholder}>
          <span>место под логотип</span>
        </div>
        <div className={styles.imageBlock}>
          <Image src="/assets/h1.png" alt="AI Human" width={400} height={300} />
        </div>
        <div className={styles.card + ' ' + styles.cardRightTop}>
          <h3>ЧТО ПОЛУЧАЮТ УЧАСТНИКИ: <span>ВСЕ В 1 МЕСТЕ</span></h3>
          <ul>
            <li>
              <Image src="/assets/icon_s1.png" alt="news" width={40} height={40} />
              Будьте вкурсе: Каждый день публикуем свежие новости индустрии, проверенные промпты и подборки полезных нейросетей для работы, бизнеса и жизни.
            </li>
            <li>
              <Image src="/assets/icon_s2.png"  alt="library" width={40} height={40} />
              Библиотека решений: Делимся готовыми шаблонами автоматизаций (Make/N8N) и списком из 200+ проверенных AI-ресурсов.
            </li>
            <li>
              <Image src="/assets/icon_s3.png"  alt="chat" width={40} height={40} />
              Живой чат поддержки: Пространство, где участники комьюнити и мы лично отвечаем на вопросы и помогаем решать технические задачи.
            </li>
            <li>
              <Image src="/assets/icon_s4.png"  alt="network" width={40} height={40} />
              Еженедельный нетворкинг: Каждый четверг в 19:30 проводим открытые онлайн-встречи. Разбираем кейсы, обсуждаем тренды и знакомимся (вход свободный для всех).
            </li>
          </ul>
        </div>
        
        <div className={styles.card + ' ' + styles.cardLeftBottom}>
          <h3>ГЕЙМИФИКАЦИЯ И ВОЗНАГРАЖДЕНИЯ</h3>
          <p>
            Мы внедрили <b>уникальную систему</b> мотивации через нашего Telegram-бота:<br /><br />
            <b>Цифровой профиль:</b> Вы настраиваете аватар и информацию о себе через бота — ваша анкета попадает в общую базу резидентов, упрощая нетворкинг.<br /><br />
            <b>Репутация = Деньги:</b> За помощь другим участникам вам начисляют очки репутации.<br /><br />
            <span className={styles.bonus}>Бонус: За каждые набранные 100 очков мы дарим подписку на любую нейросеть (эквивалент до 20$).</span>
          </p>
        </div>
        <div className={styles.imageBlock}>
          <Image src="/assets/h2.png" alt="AI Human 2" width={400} height={300} />
        </div>
      </div>
      <div className={styles.buttonWrap}>
        <CTAButton
                      href="#"
                      icon={
                        <svg width="37" height="37" viewBox="0 0 37 37" fill="none" xmlns="http://www.w3.org/2000/svg">
                          <path d="M18.2058 1.33726e-08C14.605 2.31338e-08 11.0851 1.06775 8.09121 3.06823C5.09728 5.06871 2.7638 7.91207 1.38584 11.2387C0.00788836 14.5654 -0.352647 18.226 0.349828 21.7576C1.0523 25.2892 2.78624 28.5331 5.33237 31.0792C7.87849 33.6254 11.1225 35.3593 14.654 36.0618C18.1856 36.7643 21.8462 36.4037 25.1729 35.0258C28.4996 33.6478 31.3429 31.3143 33.3434 28.3204C35.3439 25.3265 36.4116 21.8066 36.4116 18.2058C36.4118 15.8149 35.941 13.4474 35.0262 11.2385C34.1113 9.02959 32.7703 7.02252 31.0797 5.33191C29.3891 3.64131 27.382 2.30029 25.1731 1.38543C22.9642 0.470573 20.5967 -0.000198461 18.2058 1.33726e-08ZM23.9944 27.5863C23.9262 27.7562 23.8225 27.9096 23.6903 28.0362C23.558 28.1627 23.4002 28.2596 23.2275 28.3202C23.0547 28.3808 22.871 28.4037 22.6886 28.3875C22.5063 28.3713 22.3295 28.3163 22.1701 28.2262L17.2279 24.3859L14.0558 27.3123C13.9822 27.3667 13.8961 27.4017 13.8055 27.4141C13.7148 27.4265 13.6225 27.4159 13.537 27.3832L14.145 21.9425L14.1645 21.9579L14.1769 21.8505C14.1769 21.8505 23.0705 13.7535 23.4328 13.4085C23.7996 13.0644 23.6786 12.9898 23.6786 12.9898C23.6994 12.5701 23.0204 12.9898 23.0204 12.9898L11.2366 20.5707L6.32927 18.8994C6.32927 18.8994 5.57555 18.6291 5.50455 18.0347C5.42991 17.4448 6.35383 17.1244 6.35383 17.1244L25.865 9.37324C25.865 9.37324 27.4689 8.65863 27.4689 9.84206L23.9944 27.5863Z" fill="#0E0807"/>
                        </svg>
                      }
                    >
                      Вступить в комьюнити
                    </CTAButton>
      </div>
    </section>
  );
};

export default Agency;
